


#include <locale.h>
#include <stdio.h>




int main()
{
    setlocale(LC_ALL, "RUS");
    
    
    printf("%7d\n %10d\n %13d\n",1, 2, 3 );
    

    printf("%10.5f\n", 12.234567);

    printf("Остаток от деления %d на %d равен %d\n", 5,2,5%2);
    printf("Деление %d на %d равен %d\n", 7, 5, 7/5);
    printf("Умножение %d на %d равен %d\n", 2000, 4, 2000*4);
    printf("%g разделить %e равно %f\n",5., 2., 2./2);
    printf("%g разделить %g равно %g\n",5., 2., 2./2);
    printf("%e разделить %e равно %e\n",5., 2., 2./2);
    printf("%f разделить %f равно %f\n",5., 2., 2./2);

    int N = 3;
    int K = 5;
    printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
    printf("Идёт %d минута суток\n", K);
    printf("До полуночи осталось %d часов и %d минут\n", N, K);
    printf("С 8.00 прошло %d минут\n", K);
    float n = 3;
    float k = 5;
    printf("Текущий час = %f суток и текущая минута = %f часа\n", n/24, k/60);
     

    printf(" Дано:\n %15d\n %15d\n\t________\n Ответ:\n\t %+08.3f\n", 3, 333, 3./333 );


    printf("Дано:\n %15d\n %15d\n\t_________\n Ответ:\n\t %+08.3f\n", 2, 353, 2./353);




}


